andotoecno/UARDECS_esp32/lib/UARDECS_esp32/UARDECS_esp32.cpp
#include <esp32_uecs.h>

char UECSbuffer[BUF_SIZE];		   // main buffer
char UECStempStr20[MAX_TYPE_CHAR]; // sub buffer
AsyncUDP UECS_UDP16520;
AsyncUDP UECS_UDP16529;
WiFiServer UECSlogserver(80);
WiFiClient UECSclient;

struct UECSTEMPCCM UECStempCCM;

unsigned char UECSsyscounter60s;
unsigned long UECSsyscounter1s;
unsigned long UECSnowmillis;
unsigned long UECSlastmillis;

// Form CCM.cpp
// ##############################################################################
// ##############################################################################

const char *UECSattrChar[] = {
	UECSccm_ROOMTXT,
	UECSccm_REGIONTXT,
	UECSccm_ORDERTXT,
	UECSccm_PRIORITYTXT,
};
const char *UECSCCMLEVEL[] = {
	UECS_A1S0,
	UECS_A1S1,
	UECS_A10S0,
	UECS_A10S1,
	UECS_A1M0,
	UECS_A1M1,
	UECS_S1S,
	UECS_S1M,
	UECS_B0_,
	UECS_B1_,
};

boolean UECSparseRec(struct UECSTEMPCCM *_tempCCM, int *matchCCMID)
{

	int i;
	int progPos = 0;
	int startPos = 0;
	short shortValue = 0;

	if (!UECSFindPGMChar(UECSbuffer, &UECSccm_XMLHEADER[0], &progPos))
	{
		return false;
	}
	startPos += progPos;

	if (UECSFindPGMChar(&UECSbuffer[startPos], &UECSccm_UECSVER_E10[0], &progPos))
	{
		startPos += progPos;
		// E10 packet
	}
	else
	{
		// other ver packet
		if (!(U_orgAttribute.flags & ATTRFLAG_LOOSELY_VERCHECK))
		{
			return false;
		}
	}

	if (!UECSFindPGMChar(&UECSbuffer[startPos], &UECSccm_DATATYPE[0], &progPos))
	{
		return false;
	}
	startPos += progPos;

	// copy ccm type string
	for (i = 0; i < MAX_TYPE_CHAR; i++)
	{
		_tempCCM->type[i] = UECSbuffer[startPos + i];
		if (_tempCCM->type[i] == ASCIICODE_DQUOT || _tempCCM->type[i] == '\0')
		{
			_tempCCM->type[i] = '\0';
			break;
		}
	}
	_tempCCM->type[MAX_CCMTYPESIZE] = '\0';
	startPos = startPos + i;

	// In a practical environment ,packets of 99% are irrelevant CCM.
	// matching top 3 chars for acceleration
	*matchCCMID = -1;
	for (i = 0; i < U_MAX_CCM; i++)
	{
		if (U_ccmList[i].ccmLevel != NONE && U_ccmList[i].sender == false) // check receive ccm
		{
			if (_tempCCM->type[0] == pgm_read_byte(U_ccmList[i].type) &&
				_tempCCM->type[1] == pgm_read_byte(U_ccmList[i].type + 1) &&
				_tempCCM->type[2] == pgm_read_byte(U_ccmList[i].type + 2))
			{
				*matchCCMID = i;
				break;
			}
		}
	}
	if (*matchCCMID < 0)
	{
		return false;
	} // my ccm was not match ->cancel packet reading

	for (i = 0; i < MAX_ATTR_NUMBER; i++)
	{
		if (!UECSGetValPGMStrAndChr(&UECSbuffer[startPos], UECSattrChar[i], '\"', &(_tempCCM->attribute[i]), &progPos))
		{
			return false;
		}
		startPos += progPos;
	}

	// find tag end
	if (!UECSFindPGMChar(&UECSbuffer[startPos], &UECSccm_CLOSETAG[0], &progPos))
	{
		return false;
	}
	startPos += progPos;

	// get value
	if (!UECSGetFixedFloatValue(&UECSbuffer[startPos], &(_tempCCM->value), &(_tempCCM->decimal), &progPos))
	{
		return false;
	}
	startPos += progPos;

	// ip tag
	if (!UECSFindPGMChar(&UECSbuffer[startPos], &UECSccm_IPTAG[0], &progPos))
	{
		// ip tag not found(old type packet)
		// ip address is already filled
		if (!UECSFindPGMChar(&UECSbuffer[startPos], &UECSccm_FOOTER0[0], &progPos))
		{
			return false;
		}
		return true;
	}
	startPos += progPos;

	unsigned char ip[4];
	if (!UECSGetIPAddress(&UECSbuffer[startPos], ip, &progPos))
	{
		return false;
	}

	_tempCCM->address[0] = ip[0];
	_tempCCM->address[1] = ip[1];
	_tempCCM->address[2] = ip[2];
	_tempCCM->address[3] = ip[3];

	startPos += progPos;

	if (U_orgAttribute.flags & ATTRFLAG_LOOSELY_VERCHECK)
	{
		return true;
	} // Ignore information after ip

	// check footer
	if (!UECSFindPGMChar(&UECSbuffer[startPos], &UECSccm_FOOTER1[0], &progPos))
	{
		return false;
	}
	/*
	Serial.println("type");
	Serial.println(_tempCCM->type);
	Serial.println("attribute[AT_ROOM]");
	Serial.println(_tempCCM->attribute[AT_ROOM]);
	Serial.println("attribute[AT_REGI]");
	Serial.println(_tempCCM->attribute[AT_REGI]);
	Serial.println("attribute[AT_ORDE]");
	Serial.println(_tempCCM->attribute[AT_ORDE]);
	Serial.println("attribute[AT_PRIO]");
	Serial.println(_tempCCM->attribute[AT_PRIO]);
	Serial.println("value");
	Serial.println(_tempCCM->value);
	Serial.println("decimal");
	Serial.println(_tempCCM->decimal);
	Serial.println("ip[0]");
	Serial.println(_tempCCM->address[0]);
	Serial.println("ip[1]");
	Serial.println(_tempCCM->address[1]);
	Serial.println("ip[2]");
	Serial.println(_tempCCM->address[2]);
	Serial.println("ip[3]");
	Serial.println(_tempCCM->address[3]);
	*/
	return true;
}
//----------------------------------------------------------------------------
void UECSCreateCCMPacketAndSend(struct UECSCCM *_ccm)
{
	ClearMainBuffer();
	UDPAddPGMCharToBuffer(&(UECSccm_XMLHEADER[0]));
	UDPAddPGMCharToBuffer(&(UECSccm_UECSVER_E10[0]));
	UDPAddPGMCharToBuffer(&(UECSccm_DATATYPE[0]));
	UDPAddPGMCharToBuffer(_ccm->type);

	for (int i = 0; i < 3; i++)
	{
		UDPAddPGMCharToBuffer(UECSattrChar[i]);
		UDPAddValueToBuffer(_ccm->baseAttribute[i]);
	}

	UDPAddPGMCharToBuffer(UECSattrChar[AT_PRIO]);
	UDPAddValueToBuffer(_ccm->attribute[AT_PRIO]);

	UDPAddPGMCharToBuffer(&(UECSccm_CLOSETAG[0]));
	dtostrf(((double)_ccm->value) / pow(10, _ccm->decimal), -1, _ccm->decimal, UECStempStr20);
	UDPAddCharToBuffer(UECStempStr20);
	UDPAddPGMCharToBuffer(&(UECSccm_IPTAG[0]));

	if (U_orgAttribute.status & STATUS_SAFEMODE)
	{
		UDPAddPGMCharToBuffer(&(UECSdefaultIPAddress[0]));
	}
	else
	{
		sprintf(UECStempStr20, "%d.%d.%d.%d", U_orgAttribute.ip[0], U_orgAttribute.ip[1], U_orgAttribute.ip[2], U_orgAttribute.ip[3]);
		UDPAddCharToBuffer(UECStempStr20);
	}

	UDPAddPGMCharToBuffer(&(UECSccm_FOOTER1[0]));

	// send ccm
	UECS_UDP16520.writeTo((const uint8_t *)UECSbuffer, sizeof(UECSbuffer), _ccm->address, 16520);
}

void UECSupRecCCM(UECSCCM *_ccm, UECSTEMPCCM *_ccmRec)
{
	boolean success = false;

	int i;
	for (i = 0; i < MAX_ATTR_NUMBER; i++)
	{
		_ccm->attribute[i] = _ccmRec->attribute[i];
	}

	for (i = 0; i < MAX_IPADDRESS_NUMBER; i++)
	{
		_ccm->address[i] = _ccmRec->address[i];
	}

	int dif_decimal = _ccm->decimal - _ccmRec->decimal;
	if (dif_decimal >= 0)
	{
		_ccm->value = _ccmRec->value * pow(10, dif_decimal);
	}
	else
	{
		_ccm->value = _ccmRec->value / pow(10, -dif_decimal);
	}

	_ccm->recmillis = 0;
	_ccm->validity = true;
	_ccm->flagStimeRfirst = true;
}
//---------------------------------------------------------------

void UECScheckUpDate(UECSTEMPCCM *_tempCCM, unsigned long _time, int startid)
{

