andotoecno/UARDECS_esp32/lib/UARDECS_esp32/UARDECS_esp32.cpp
	for (int i = startid; i < U_MAX_CCM; i++)
	{
		if (U_ccmList[i].ccmLevel == NONE || U_ccmList[i].sender == true)
		{
			continue;
		}

		if (!((_tempCCM->attribute[AT_ROOM] == 0 || U_ccmList[i].baseAttribute[AT_ROOM] == 0 || _tempCCM->attribute[AT_ROOM] == U_ccmList[i].baseAttribute[AT_ROOM]) &&
			  (_tempCCM->attribute[AT_REGI] == 0 || U_ccmList[i].baseAttribute[AT_REGI] == 0 || _tempCCM->attribute[AT_REGI] == U_ccmList[i].baseAttribute[AT_REGI]) &&
			  (_tempCCM->attribute[AT_ORDE] == 0 || U_ccmList[i].baseAttribute[AT_ORDE] == 0 || _tempCCM->attribute[AT_ORDE] == U_ccmList[i].baseAttribute[AT_ORDE])))
		{
			continue;
		}

		// type
		strcpy_P(UECStempStr20, U_ccmList[i].type);

		/*
		if(U_orgAttribute.flags&ATTRFLAG_ALLOW_ABRIDGE_TYPE)
			{
			strtok(UECStempStr20,".");
			strtok(_tempCCM->type,".");
			}
			*/
		if (strcmp(UECStempStr20, _tempCCM->type) != 0)
		{
			continue;
		}

		boolean up = false;
		if (U_ccmList[i].ccmLevel == B_0 || U_ccmList[i].ccmLevel == B_1)
		{
			up = true;
		}
		else if (!U_ccmList[i].validity)
		{
			up = true;
		} // fresh ccm
		else if (_tempCCM->attribute[AT_PRIO] < U_ccmList[i].attribute[AT_PRIO])
		{
			up = true;
		} // lower priority number is strong
		else
		{

			if (_tempCCM->attribute[AT_ROOM] == U_ccmList[i].attribute[AT_ROOM])
			{
				if (_tempCCM->attribute[AT_REGI] == U_ccmList[i].attribute[AT_REGI])
				{
					if (_tempCCM->attribute[AT_ORDE] == U_ccmList[i].attribute[AT_ORDE])
					{

						// if(_tempCCM->address <= U_ccmList[i].address)
						// convert big endian
						unsigned long address_t = _tempCCM->address[0];
						address_t = (address_t << 8) | _tempCCM->address[1];
						address_t = (address_t << 8) | _tempCCM->address[2];
						address_t = (address_t << 8) | _tempCCM->address[3];
						unsigned long address_b = U_ccmList[i].address[0];
						address_b = (address_b << 8) | U_ccmList[i].address[1];
						address_b = (address_b << 8) | U_ccmList[i].address[2];
						address_b = (address_b << 8) | U_ccmList[i].address[3];

						if (address_t <= address_b)
						{
							up = true;
						}
					}
					else if (_tempCCM->attribute[AT_ORDE] == U_ccmList[i].baseAttribute[AT_ORDE] || U_ccmList[i].baseAttribute[AT_ORDE] == 0)
					{
						up = true;
					}
				}
				else if (_tempCCM->attribute[AT_REGI] == U_ccmList[i].baseAttribute[AT_REGI] || U_ccmList[i].baseAttribute[AT_REGI] == 0)
				{
					up = true;
				}
			}
			else if (_tempCCM->attribute[AT_ROOM] == U_ccmList[i].baseAttribute[AT_ROOM] || U_ccmList[i].baseAttribute[AT_ROOM] == 0)
			{
				up = true;
			}
		}

		if (up)
		{
			UECSupRecCCM(&U_ccmList[i], _tempCCM);
		}
	}
}

/********************************/
/* 16529 Response   *************/
/********************************/

boolean UECSresNodeScan()
{
	int i;
	int progPos = 0;
	int startPos = 0;

	if (!UECSFindPGMChar(UECSbuffer, &UECSccm_XMLHEADER[0], &progPos))
	{
		return false;
	}
	startPos += progPos;

	if (!UECSFindPGMChar(&UECSbuffer[startPos], &UECSccm_UECSVER_E10[0], &progPos))
	{
		// other ver
		return false;
	}
	startPos += progPos;

	// NODESCAN
	if (UECSFindPGMChar(&UECSbuffer[startPos], &UECSccm_NODESCAN1[0], &progPos) || UECSFindPGMChar(&UECSbuffer[startPos], &UECSccm_NODESCAN2[0], &progPos))
	{

		// NODESCAN response
		ClearMainBuffer();
		UDPAddPGMCharToBuffer(&(UECSccm_XMLHEADER[0]));
		UDPAddPGMCharToBuffer(&(UECSccm_UECSVER_E10[0]));
		UDPAddPGMCharToBuffer(&(UECSccm_NODENAME[0]));
		UDPAddPGMCharToBuffer(&(U_name[0]));
		UDPAddPGMCharToBuffer(&(UECSccm_VENDER[0]));
		UDPAddPGMCharToBuffer(&(U_vender[0]));
		UDPAddPGMCharToBuffer(&(UECSccm_UECSID[0]));
		UDPAddPGMCharToBuffer(&(U_uecsid[0]));
		UDPAddPGMCharToBuffer(&(UECSccm_UECSID_IP[0]));

		if (U_orgAttribute.status & STATUS_SAFEMODE)
		{
			UDPAddPGMCharToBuffer(&(UECSdefaultIPAddress[0]));
		}
		else
		{
			sprintf(UECStempStr20, "%d.%d.%d.%d", U_orgAttribute.ip[0], U_orgAttribute.ip[1], U_orgAttribute.ip[2], U_orgAttribute.ip[3]);
			UDPAddCharToBuffer(UECStempStr20);
		}

		UDPAddPGMCharToBuffer(&(UECSccm_MAC[0]));
		sprintf(UECStempStr20, "%02X%02X%02X%02X%02X%02X", U_orgAttribute.mac[0], U_orgAttribute.mac[1], U_orgAttribute.mac[2], U_orgAttribute.mac[3], U_orgAttribute.mac[4], U_orgAttribute.mac[5]);
		UDPAddCharToBuffer(UECStempStr20);
		UDPAddPGMCharToBuffer(&(UECSccm_NODECLOSE[0]));

		return true;
	}

	// CCMSCAN
	if (UECSFindPGMChar(&UECSbuffer[startPos], &UECSccm_CCMSCAN[0], &progPos))
	{

		short pageNum = 0;
		startPos += progPos;

		if (UECSGetValPGMStrAndChr(&UECSbuffer[startPos], &UECSccm_PAGE[0], '\"', &pageNum, &progPos)) // format of page number written type
		{
			startPos += progPos;
			// check close tag
			if (!(UECSFindPGMChar(&UECSbuffer[startPos], &UECSccm_CCMSCANCLOSE2[0], &progPos)))
			{
				return false;
			}
		}
		else if (UECSFindPGMChar(&UECSbuffer[startPos], &UECSccm_CCMSCANCLOSE0[0], &progPos)) // format of page number abridged type
		{
			pageNum = 1;
		}
		else
		{
			return false;
		}

		// CCMSCAN response
		ClearMainBuffer();
		UDPAddPGMCharToBuffer(&(UECSccm_XMLHEADER[0]));
		UDPAddPGMCharToBuffer(&(UECSccm_UECSVER_E10[0]));
		UDPAddPGMCharToBuffer(&(UECSccm_CCMNUM[0]));

		// count enabled ccm
		short enabledCCMNum = 0;
		short returnCCMID = -1;
		for (i = 0; i < U_MAX_CCM; i++)
		{
			if (U_ccmList[i].ccmLevel != NONE)
			{
				enabledCCMNum++;
				if (enabledCCMNum == pageNum)
				{
					returnCCMID = i;
				}
			}
		}

		if (enabledCCMNum == 0 || returnCCMID < 0)
		{
			return false;
		} // page num over

		UDPAddValueToBuffer(pageNum);
		UDPAddPGMCharToBuffer(&(UECSccm_TOTAL[0]));
		UDPAddValueToBuffer(enabledCCMNum);
		UDPAddPGMCharToBuffer(&(UECSccm_CLOSETAG[0]));
		UDPAddValueToBuffer(1); // Column number is always 1
		UDPAddPGMCharToBuffer(&(UECSccm_CCMNO[0]));
		UDPAddValueToBuffer(pageNum); // page number = ccm number

		for (i = 0; i < 3; i++)
		{
			UDPAddPGMCharToBuffer(UECSattrChar[i]);
			UDPAddValueToBuffer(U_ccmList[returnCCMID].baseAttribute[i]);
		}
		UDPAddPGMCharToBuffer(UECSattrChar[AT_PRIO]);
		UDPAddValueToBuffer(U_ccmList[returnCCMID].attribute[AT_PRIO]);

