andotoecno/UARDECS_esp32/lib/UARDECS_esp32/UARDECS_esp32.cpp
	int i;
	int startPos = 0;
	int progPos = 0;
	long tempValue;
	unsigned char tempDecimal;

	for (i = 0; i < U_HtmlLine; i++)
	{
		if (!UECSFindPGMChar(&UECSbuffer[startPos], UECSaccess_LEQUAL, &progPos))
		{
			continue;
		}
		startPos += progPos;

		if (U_html[i].pattern == UECSINPUTDATA)
		{

			if (!UECSGetFixedFloatValue(&UECSbuffer[startPos], &tempValue, &tempDecimal, &progPos))
			{
				return;
			}
			startPos += progPos;
			if (UECSbuffer[startPos] != '&')
			{
				return;
			} // last '&' not found

			int dif_decimal = U_html[i].decimal - tempDecimal;
			if (dif_decimal >= 0)
			{
				*U_html[i].data = tempValue * pow(10, dif_decimal);
			}
			else
			{
				*U_html[i].data = tempValue / pow(10, -dif_decimal);
			}

			if (*U_html[i].data < U_html[i].minValue)
			{
				*U_html[i].data = U_html[i].minValue;
			}
			if (*U_html[i].data > U_html[i].maxValue)
			{
				*U_html[i].data = U_html[i].maxValue;
			}
		}
		else if (U_html[i].pattern == UECSSELECTDATA)
		{

			if (!UECSGetFixedFloatValue(&UECSbuffer[startPos], &tempValue, &tempDecimal, &progPos))
			{
				return;
			}
			startPos += progPos;

			if (UECSbuffer[startPos] != '&')
			{
				return;
			} // last '&' not found

			if (tempDecimal != 0)
			{
				return;
			}
			*U_html[i].data = tempValue % U_html[i].selectnum; // cut too big value
		}
	}

	OnWebFormRecieved();

	for (i = 0; i < U_HtmlLine; i++)
	{
		UECS_EEPROM_writeLong(EEPROM_OFFSET_WEBDATA + i * 4, *(U_html[i].data));
	}
}
//--------------------------------------------------------------------------
void HTTPGetFormDataLANSettingPage()
{
	int i;
	int startPos = 0;
	int progPos = 0;
	long UECStempValue[20];
	unsigned char tempDecimal;
	int skip_counter = 0;
	//
	// MYIP      4
	// SUBNET    4
	// GATEWAY   4
	// DNS       4
	// room      1
	// region    1
	// order     1
	//-------------
	// total    19

	// get value
	for (i = 0; i < 19; i++)
	{
		if (!UECSFindPGMChar(&UECSbuffer[startPos], UECSaccess_LEQUAL, &progPos))
		{
			return;
		}
		startPos += progPos;
		if (!UECSGetFixedFloatValue(&UECSbuffer[startPos], &UECStempValue[i], &tempDecimal, &progPos))
		{
			return;
		}
		startPos += progPos;
		if (UECSbuffer[startPos] != '&')
		{
			return;
		} // last '&' not found
		if (tempDecimal != 0)
		{
			return;
		}

		// check value and write
		if (i < 18 && (UECStempValue[i] < 0 || UECStempValue[i] > 255))
		{
			return;
		} // IP address,room,region
		else if (UECStempValue[i] < 0 || UECStempValue[i] > 30000)
		{
			return;
		} // order
	}

	// order requires 2byte
	// UECStempValue[18]	order low
	// UECStempValue[19]	order high
	// set "order" high-byte
	UECStempValue[19] = (UECStempValue[18] / 256) & 127;

	skip_counter = 0;
	for (int i = 0; i < 20; i++)
	{
		if (EEPROM.read(EEPROM_OFFSET_DATATOP + i) != (unsigned char)UECStempValue[i]) // skip same value
		{
			EEPROM.write(EEPROM_OFFSET_DATATOP + i, (unsigned char)UECStempValue[i]);
			U_orgAttribute.status |= STATUS_NEEDRESET;

			// EEPROM.commit();
			Serial.println("save UECS main buf");
			// delay(100);
		}
		else skip_counter++;
	}
	// writing EEPROM, ESP32 specification
	Serial.println(skip_counter);
	if (skip_counter < 20)
	{
EEPROM.commit();
	}

	//---------------------------NODE NAME
	if (!UECSFindPGMChar(&UECSbuffer[startPos], UECSaccess_LEQUAL, &progPos))
	{
		return;
	}
	startPos += progPos;

	// copy node name
	for (i = 0; i < 20; i++)
	{

		if (UECSbuffer[startPos + i] == '<' || UECSbuffer[startPos + i] == '>') // eliminate tag
		{
			UECSbuffer[startPos + i] = '*';
		}

		if (UECSbuffer[startPos + i] == '&')
		{
			break;
		}
		if (UECSbuffer[startPos + i] == '\0' || i == 19)
		{
			return;
		} // �I�[�������̂Ŗ���
		// prevention of Cutting multibyte UTF-8 code
		if (i >= 16 && (unsigned char)UECSbuffer[startPos + i] >= 0xC0) // UTF-8 multibyte code header
		{

			break;
		}

		UECStempStr20[i] = UECSbuffer[startPos + i];
	}

	UECStempStr20[i] = '\0'; // set end code

	for (int i = 0; i < 20; i++)
	{
		U_nodename[i] = UECStempStr20[i];

		if (EEPROM.read(EEPROM_OFFSET_NODENAME + i) != U_nodename[i]) // skip same value
		{
			EEPROM.write(EEPROM_OFFSET_NODENAME + i, U_nodename[i]);
			// EEPROM.commit();
			// delay(100);
			Serial.println("save UECS Node Name");
		}
		else skip_counter++;
	}
	// writing EEPROM, ESP32 specification
	Serial.println(skip_counter);
	if (skip_counter < 20)
	{
EEPROM.commit();
	}

	return;
}

//---------------------------------------------####################
void HTTPcheckRequest()
{
	UECSclient = UECSlogserver.available();
	// Caution! This function can not receive only up to the top 299 bytes.
	// Dropped string will be ignored.

	if (UECSclient)
	{

		// Add null termination
		UECSbuffer[UECSclient.read((uint8_t *)UECSbuffer, BUF_SIZE - 1)] = '\0';

		HTTPFilterToBuffer(); // Get first line before "&S=" and eliminate unnecessary code
		Serial.println(UECSbuffer);
		int progPos = 0;
		// Top Page
		if (UECSFindPGMChar(UECSbuffer, &(UECSaccess_NOSPC_GETP0[0]), &progPos))
		{
			HTTPsendPageIndex();
		}
		// CCM page
		else if (UECSFindPGMChar(UECSbuffer, &(UECSaccess_NOSPC_GETP1[0]), &progPos))
		{
			HTTPsendPageCCM();
		}
		// LAN setting page
		else if (UECSFindPGMChar(UECSbuffer, &(UECSaccess_NOSPC_GETP2[0]), &progPos))
		{
			HTTPsendPageLANSetting();
		}
		// send CCM
		else if (UECSFindPGMChar(UECSbuffer, &(UECSaccess_NOSPC_GETP1A[0]), &progPos)) // include form data
		{
			HTTPGetFormDataCCMPage();
			// HTTPsendPageCCM();
			HTTPPrintRedirectP1();
		}
		// send LAN setting
		else if (UECSFindPGMChar(UECSbuffer, &(UECSaccess_NOSPC_GETP2A[0]), &progPos)) // include form data
		{
			HTTPGetFormDataLANSettingPage(); // save setting
			HTTPsendPageLANSetting();		 // reload LAN setting page
		}
		else
		{
			HTTPsendPageError();
		}
	}
	UECSclient.stop();
}

//////////////////
//// html ////////
//////////////////

void UDPReadCallback(AsyncUDPPacket packet)
{
}

void UECSupdate16520portReceive(UECSTEMPCCM *_tempCCM, unsigned long _millis)
{
	int packetSize = UECS_UDP16520.listen(16520);
	int matchCCMID = -1;
	if (packetSize)
	{
		ClearMainBuffer();
		UECS_UDP16520.onPacket([_tempCCM](AsyncUDPPacket packet)
							   { 
			_tempCCM->address = packet.remoteIP();
			UECSbuffer[packet.read((uint8_t *)UECSbuffer, BUF_SIZE - 1)] = '\0'; });
		UDPFilterToBuffer();

		if (UECSparseRec(_tempCCM, &matchCCMID))
		{
			UECScheckUpDate(_tempCCM, _millis, matchCCMID);
		}
	}
}

void UECSupdate16529port(UECSTEMPCCM *_tempCCM)
{
	int packetSize = UECS_UDP16529.listen(16529);
	if (packetSize)
	{
		ClearMainBuffer();
		UECS_UDP16529.onPacket([_tempCCM](AsyncUDPPacket packet)
							   { 
			_tempCCM->address = packet.remoteIP();
			UECSbuffer[packet.read((uint8_t *)UECSbuffer, BUF_SIZE - 1)] = '\0'; });
		UDPFilterToBuffer();

		if (UECSresNodeScan())
		{
			UECS_UDP16529.writeTo((const uint8_t *)UECSbuffer, sizeof(UECSbuffer), _tempCCM->address, 16529);
		}
	}
}
//----------------------------------

void UECSsetup()
{
	delay(500);
	pinMode(U_InitPin, INPUT_PULLUP);


	EEPROM.begin(1024);
	Serial.begin(115200);

	if (digitalRead(U_InitPin) == U_InitPin_Sense || UECS_EEPROM_readLong(EEPROM_OFFSET_IP) == -1)
	{
		U_orgAttribute.status |= STATUS_SAFEMODE;
		Serial.println("Wakeup with safe mode");
	}
	else
	{
		U_orgAttribute.status &= STATUS_SAFEMODE_MASK; // Release safemode
		Serial.println("Wakeup with CCM mode");
	}

