andotoecno/UARDECS_esp32/lib/UARDECS_esp32/UARDECS_esp32.cpp
	UECSinitOrgAttribute();
	UECSinitCCMList();
	UserInit();
	UECSstartEthernet();
}

void UECSstartEthernet()
{

	if (U_orgAttribute.status & STATUS_SAFEMODE)
	{
		byte defip[] = {192, 168, 33, 7};
		byte defsubnet[] = {255, 255, 255, 0};
		byte defdummy[] = {0, 0, 0, 0};
		if (!WiFi.config(defip, defip, defsubnet, defdummy))
		{ // ip,gateway,subnet,dns
			Serial.println("Failed to configure!");
		}
	}
	else
	{
		if (!WiFi.config(U_orgAttribute.ip, U_orgAttribute.gateway, U_orgAttribute.subnet, U_orgAttribute.dns))
		{ // ip,gateway,subnet,dns
			Serial.println("Failed to configure of WiFi");
		}
	}

	WiFi.begin(WiFi_SSID, WiFi_PASS);
	while (WiFi.status() != WL_CONNECTED)
	{
		delay(2000);
		Serial.println("WiFi connecting");
	}
	Serial.println("WiFi connected");
	Serial.println(WiFi.localIP());
	char ip[20], gateway[20], subnet[20];
	sprintf(ip, "%d.%d.%d.%d", U_orgAttribute.ip[0], U_orgAttribute.ip[1], U_orgAttribute.ip[2], U_orgAttribute.ip[3]);
	sprintf(gateway, "%d.%d.%d.%d", U_orgAttribute.gateway[0], U_orgAttribute.gateway[1], U_orgAttribute.gateway[2], U_orgAttribute.gateway[3]);
	sprintf(subnet, "%d.%d.%d.%d", U_orgAttribute.subnet[0], U_orgAttribute.subnet[1], U_orgAttribute.subnet[2], U_orgAttribute.subnet[3]);
	Serial.println(ip);
	Serial.println(gateway);
	Serial.println(subnet);
	UECSlogserver.begin();
}

//---------------------------------------------------------
void UECSresetEthernet()
{
	// UECS_UDP16520.close();
	// UECS_UDP16529.close();
	// SPI.end();
	UECSstartEthernet();
}
//------------------------------------------------------------------------
// Software reset command
// call 0
typedef int (*CALLADDR)(void);
void SoftReset(void)
{
	CALLADDR resetAddr = 0;
	(resetAddr)();
}
//---------------------------------------------------------
//---------------------------------------------------------
//----------------------------------------------------------------------

void UECSloop()
{

	// network Check
	// 1. http request
	// 2. udp16520Receive
	// 3. udp16529Receive and Send
	// << USER MANAGEMENT >>
	// 4. udp16520Send
	HTTPcheckRequest();
	UECSupdate16520portReceive(&UECStempCCM, UECSnowmillis);
	UECSupdate16529port(&UECStempCCM);
	UserEveryLoop();

	UECSnowmillis = millis();
	if (UECSnowmillis == UECSlastmillis)
	{
		return;
	}

	// how long elapsed?
	unsigned long td = UECSnowmillis - UECSlastmillis;
	// check overflow
	if (UECSnowmillis < UECSlastmillis)
	{
		td = (4294967295 - UECSlastmillis) + UECSnowmillis;
	}

	// over 1msec
	UECSsyscounter1s += td;
	UECSlastmillis = UECSnowmillis;
	UECSautomaticValidManager(td);

	if (UECSsyscounter1s < 999)
	{
		return;
	}
	// over 1000msec
	UECSsyscounter1s = 0;
	UECSsyscounter60s++;

	if (UECSsyscounter60s >= 60)
	{
		UserEveryMinute();
		UECSsyscounter60s = 0;
	}

	UECSautomaticSendManager();
	UserEverySecond();

	for (int i = 0; i < U_MAX_CCM; i++)
	{
		if (U_ccmList[i].sender && U_ccmList[i].flagStimeRfirst && U_ccmList[i].ccmLevel != NONE)
		{
			UECSCreateCCMPacketAndSend(&U_ccmList[i]);
			// U_ccmList[i].old_value=U_ccmList[i].value;
		}
	}
}
//------------------------------------------------------
void UECSinitOrgAttribute()
{

	for (int i = 0; i < 4; i++)
	{
		U_orgAttribute.ip[i] = EEPROM.read(i + EEPROM_OFFSET_IP);
		U_orgAttribute.subnet[i] = EEPROM.read(i + EEPROM_OFFSET_SUBNET);
		U_orgAttribute.gateway[i] = EEPROM.read(i + EEPROM_OFFSET_GATEWAY);
		U_orgAttribute.dns[i] = EEPROM.read(i + EEPROM_OFFSET_DNS);
	}

	// reset web form
	for (int i = 0; i < U_HtmlLine; i++)
	{
		*(U_html[i].data) = U_html[i].minValue;
	}

	U_orgAttribute.room = EEPROM.read(EEPROM_OFFSET_ROOM);
	U_orgAttribute.region = EEPROM.read(EEPROM_OFFSET_REGION);
	U_orgAttribute.order = EEPROM.read(EEPROM_OFFSET_ORDER_L) + (unsigned short)(EEPROM.read(EEPROM_OFFSET_ORDER_H)) * 256;
	if (U_orgAttribute.order > 30000)
	{
		U_orgAttribute.order = 30000;
	}

	if (U_orgAttribute.status & STATUS_SAFEMODE)
	{
		return;
	}

	for (int i = 0; i < 20; i++)
	{
		U_nodename[i] = EEPROM.read(EEPROM_OFFSET_NODENAME + i);
	}

	for (int i = 0; i < U_HtmlLine; i++)
	{
		*(U_html[i].data) = UECS_EEPROM_readLong(EEPROM_OFFSET_WEBDATA + i * 4);
	}
}
//------------------------------------------------------
void UECSinitCCMList()
{
	for (int i = 0; i < U_MAX_CCM; i++)
	{
		U_ccmList[i].ccmLevel = NONE;
		U_ccmList[i].validity = false;
		U_ccmList[i].flagStimeRfirst = false;
		U_ccmList[i].recmillis = 0;

		/*
		U_ccmList[i].address[0] = 255;
		U_ccmList[i].address[1] = 255;
		U_ccmList[i].address[2] = 255;
		U_ccmList[i].address[3] = 255;
		U_ccmList[i].typeTxt[0]='\0';
		U_ccmList[i].attribute[AT_ROOM] = 1;
		U_ccmList[i].attribute[AT_REGI] = 1;
		U_ccmList[i].attribute[AT_ORDE] = 1;
		U_ccmList[i].attribute[AT_PRIO] = 29;
		U_ccmList[i].baseAttribute[AT_ROOM] = U_orgAttribute.room;
		U_ccmList[i].baseAttribute[AT_REGI] = U_orgAttribute.region;
		U_ccmList[i].baseAttribute[AT_ORDE] = U_orgAttribute.order;
		U_ccmList[i].baseAttribute[AT_PRIO] = 29;
		*/
	}
}

void UECSsetCCM(boolean _sender, signed char _num, const char *_name, const char *_type, const char *_unit, unsigned short _priority, unsigned char _decimal, char _ccmLevel)
{
	if (_num > U_MAX_CCM || _num < 0)
	{
		return;
	}
	U_ccmList[_num].sender = _sender;
	U_ccmList[_num].ccmLevel = _ccmLevel;

	U_ccmList[_num].name = _name;
	U_ccmList[_num].type = _type;
	U_ccmList[_num].unit = _unit;
	U_ccmList[_num].baseAttribute[AT_ROOM] = U_orgAttribute.room;
	U_ccmList[_num].baseAttribute[AT_REGI] = U_orgAttribute.region;
	U_ccmList[_num].baseAttribute[AT_ORDE] = U_orgAttribute.order;
	U_ccmList[_num].attribute[AT_ROOM] = 0;
	U_ccmList[_num].attribute[AT_REGI] = 0;
	U_ccmList[_num].attribute[AT_ORDE] = 0;
	U_ccmList[_num].attribute[AT_PRIO] = _priority;
	U_ccmList[_num].decimal = _decimal;
	U_ccmList[_num].ccmLevel = _ccmLevel;
	U_ccmList[_num].address[0] = 255;
	U_ccmList[_num].address[1] = 255;
	U_ccmList[_num].address[2] = 255;
	U_ccmList[_num].address[3] = 255;
	return;
}

// ####################################String Buffer control
static int wp;
void ClearMainBuffer()
{
	UECSbuffer[0] = '\0';
	wp = 0;
}
//-----------------------------------
void UDPAddPGMCharToBuffer(const char *_romword)
{
	for (int i = 0; i <= MAXIMUM_STRINGLENGTH; i++)
	{
		UECSbuffer[wp] = pgm_read_byte(&_romword[i]);
		if (UECSbuffer[wp] == '\0')
		{
			break;
		}
		wp++;
	}

	MemoryWatching();
}
//-----------------------------------
void UDPAddCharToBuffer(char *word)
{
	strcat(UECSbuffer, word);
	wp = strlen(UECSbuffer);

	MemoryWatching();
}
//-----------------------------------
void UDPAddValueToBuffer(long value)
{
	sprintf(&UECSbuffer[wp], "%ld", value);
	wp = strlen(UECSbuffer);

	MemoryWatching();
}
//-----------------------------------
void HTTPAddPGMCharToBuffer(const char *_romword)
{
	for (int i = 0; i <= MAXIMUM_STRINGLENGTH; i++)
	{
		UECSbuffer[wp] = pgm_read_byte(&_romword[i]);
		if (UECSbuffer[wp] == '\0')
		{
			break;
		}
		wp++;
		// auto send
		if (wp > BUF_HTTP_REFRESH_SIZE)
		{
			HTTPRefreshBuffer();
		}
	}

	MemoryWatching();
}
//---------------------------------------------
void HTTPAddCharToBuffer(char *word)
{
	for (int i = 0; i <= MAXIMUM_STRINGLENGTH; i++)
	{
		UECSbuffer[wp] = word[i];
		if (UECSbuffer[wp] == '\0')
		{
			break;
		}
		wp++;
		// auto send
		if (wp > BUF_HTTP_REFRESH_SIZE)
		{
			HTTPRefreshBuffer();
		}
	}
	MemoryWatching();
}
//---------------------------------------------
void HTTPAddValueToBuffer(long value)
{
	sprintf(&UECSbuffer[wp], "%ld", value);
	wp = strlen(UECSbuffer);

	if (wp > BUF_HTTP_REFRESH_SIZE)
	{
		HTTPRefreshBuffer();
	}

	MemoryWatching();
}
void HTTPRefreshBuffer(void)
{

	UECSbuffer[wp] = '\0';
	UECSclient.print(UECSbuffer);
	ClearMainBuffer();
}
void HTTPCloseBuffer(void)
{

	if (strlen(UECSbuffer) > 0)
	{
		UECSclient.print(UECSbuffer);
	}
}
//------------------------------------
// delete \r,\n and contorol code
// replace the continuous space character to 1 space
// Attention:first one character is ignored without delete.
//------------------------------------
void UDPFilterToBuffer(void)
{

