andotoecno/UARDECS_esp32/lib/UARDECS_esp32/UARDECS_esp32.cpp
	int s_size = strlen(UECSbuffer);
	int write = 0, read = 0;
	int i, j;
	for (i = 1; i < s_size; i++)
	{
		if (UECSbuffer[i] == '\0')
		{
			break;
		}

		// find space
		if (UECSbuffer[i] < ASCIICODE_SPACE || (UECSbuffer[i] == ASCIICODE_SPACE && UECSbuffer[i - 1] == ASCIICODE_SPACE))
		{
			write = i;
			// find end of space
			for (j = write; j <= s_size; j++)
			{
				if (UECSbuffer[j] > ASCIICODE_SPACE || UECSbuffer[j] == '\0')
				{
					read = j;
					break;
				}
			}
			// copy str to fill space
			for (j = read; j <= s_size; j++)
			{
				UECSbuffer[write + (j - read)] = UECSbuffer[j];
			}
		}
	}
	MemoryWatching();
}
//------------------------------------
// delete space and contorol code for http response
//\r,\n is regarded to end
// Attention:first one character is ignored without delete.
// decode URL like %nn to char code
//------------------------------------
void HTTPFilterToBuffer(void)
{
	int s_size = strlen(UECSbuffer);
	int write = 0, read = 0;
	int i, j;

	// decode after %
	for (i = 1; i < s_size; i++)
	{
		if ((unsigned char)UECSbuffer[i] < ASCIICODE_SPACE || (UECSbuffer[i - 1] == '&' && UECSbuffer[i] == 'S' && UECSbuffer[i + 1] == '='))
		{
			UECSbuffer[i] = '\0';
			break;
		}

		if (UECSbuffer[i] == '%')
		{
			unsigned char decode = 0;
			if (UECSbuffer[i + 1] >= 'A' && UECSbuffer[i + 1] <= 'F')
			{
				decode = UECSbuffer[i + 1] + 10 - 'A';
			}
			else if (UECSbuffer[i + 1] >= 'a' && UECSbuffer[i + 1] <= 'f')
			{
				decode = UECSbuffer[i + 1] + 10 - 'a';
			}
			else if (UECSbuffer[i + 1] >= '0' && UECSbuffer[i + 1] <= '9')
			{
				decode = UECSbuffer[i + 1] - '0';
			}

			if (decode != 0)
			{
				decode = decode * 16;
				if (UECSbuffer[i + 2] >= 'A' && UECSbuffer[i + 2] <= 'F')
				{
					decode += UECSbuffer[i + 2] + 10 - 'A';
				}
				else if (UECSbuffer[i + 2] >= 'a' && UECSbuffer[i + 2] <= 'f')
				{
					decode += UECSbuffer[i + 2] + 10 - 'a';
				}
				else if (UECSbuffer[i + 2] >= '0' && UECSbuffer[i + 2] <= '9')
				{
					decode += UECSbuffer[i + 2] - '0';
				}
				else
				{
					decode = 0;
				}

				if (decode != 0)
				{
					if (decode == '&')
					{
						decode = '*';
					}
					UECSbuffer[i] = decode;
					UECSbuffer[i + 1] = ' ';
					UECSbuffer[i + 2] = ' ';
				}
			}
		}
	}

	s_size = strlen(UECSbuffer);

	for (i = 1; i < s_size; i++)
	{
		// eliminate tag
		// if(UECSbuffer[i]=='<' || UECSbuffer[i]=='>'){UECSbuffer[i]=' ';}

		// find space
		if (UECSbuffer[i] <= ASCIICODE_SPACE)
		{
			write = i;
			// find end of space
			for (j = write; j <= s_size; j++)
			{
				if ((unsigned char)(UECSbuffer[j]) > ASCIICODE_SPACE || UECSbuffer[j] == '\0')
				{
					read = j;
					break;
				}
			}
			// copy str to fill space
			for (j = read; j <= s_size; j++)
			{
				UECSbuffer[write + (j - read)] = UECSbuffer[j];
			}
		}
	}
	MemoryWatching();
}

//------------------------------------
bool UECSFindPGMChar(char *targetBuffer, const char *_romword_startStr, int *lastPos)
{
	*lastPos = 0;
	int startPos = -1;
	int _targetBuffersize = strlen(targetBuffer);
	int _startStrsize = strlen_P(_romword_startStr);
	if (_targetBuffersize < _startStrsize)
	{
		return false;
	}

	int i, j;

	//-------------start string check
	unsigned char startchr = pgm_read_byte(&_romword_startStr[0]);
	for (i = 0; i < _targetBuffersize - _startStrsize + 1; i++)
	{
		// not hit
		if (targetBuffer[i] != startchr)
		{
			continue;
		}

		// if hit 1 chr ,more check
		for (j = 0; j < _startStrsize; j++)
		{
			if (targetBuffer[i + j] != pgm_read_byte(&_romword_startStr[j]))
			{
				break;
			} // not hit!
		}
		// hit all chr
		if (j == _startStrsize)
		{
			startPos = i;
			break;
		}
	}

	if (startPos < 0)
	{
		return false;
	}
	*lastPos = startPos + _startStrsize;
	return true;
}

//------------------------------------
bool UECSGetValPGMStrAndChr(char *targetBuffer, const char *_romword_startStr, char end_asciiCode, short *shortValue, int *lastPos)
{
	int _targetBuffersize = strlen(targetBuffer);
	*lastPos = -1;
	int startPos = -1;
	int i;
	if (!UECSFindPGMChar(targetBuffer, _romword_startStr, &startPos))
	{
		false;
	}

	if (targetBuffer[startPos] < '0' || targetBuffer[startPos] > '9')
	{
		return false;
	}
	//------------end code check
	for (i = startPos; i < _targetBuffersize; i++)
	{
		if (targetBuffer[i] == '\0')
		{
			return false;
		} // no end code found
		if (targetBuffer[i] == end_asciiCode)
		{
			break;
		}
	}

	if (i >= _targetBuffersize)
	{
		return false;
	} // not found
	*lastPos = i;

	//*shortValue=UECSAtoI(&targetBuffer[startPos]);
	long longVal;
	unsigned char decimal;
	int progPos;
	if (!(UECSGetFixedFloatValue(&targetBuffer[startPos], &longVal, &decimal, &progPos)))
	{
		return false;
	}

	if (decimal != 0)
	{
		return false;
	}
	*shortValue = (short)longVal;
	if (*shortValue != longVal)
	{
		return false;
	} // over flow!

	return true;
}

/*
//------------------------------------
bool UECSGetValueBetweenChr(char* targetBuffer,char start_asciiCode, char end_asciiCode,short *shortValue,int *lastPos)
{
int _targetBuffersize=strlen(targetBuffer);
*lastPos=-1;
int startPos=-1;
int i;

//-------------start string check
for(i=0;i<_targetBuffersize;i++)
	{
	if(targetBuffer[i]==start_asciiCode){startPos=i+1;break;}
	}

*lastPos=i;
if(startPos<0){return false;}

if(targetBuffer[startPos]<'0' || targetBuffer[startPos]>'9'){return false;}

//------------end code check
for(i=startPos;i<_targetBuffersize;i++)
{
if(targetBuffer[i]=='\0'){return false;}//no end code found
if(targetBuffer[i]==end_asciiCode)
	{break;}
}

if(i>=_targetBuffersize){return false;}//not found
*lastPos=i;
*shortValue=atoi(&targetBuffer[startPos]);
return true;

}
*/
bool UECSGetIPAddress(char *targetBuffer, unsigned char *ip, int *lastPos)
{
	int _targetBuffersize = strlen(targetBuffer);
	int i;
	int progPos = 0;
	(*lastPos) = 0;

	// find first number
	for ((*lastPos); i < _targetBuffersize; (*lastPos)++)
	{
		if (targetBuffer[(*lastPos)] >= '0' && targetBuffer[(*lastPos)] <= '9')
		{
			break;
		}
	}
	if ((*lastPos) == _targetBuffersize)
	{
		return false;
	} // number not found

	// decode ip address
	for (i = 0; i <= 2; i++)
	{
		if (!UECSAtoI_UChar(&targetBuffer[(*lastPos)], &ip[i], &progPos))
		{
			return false;
		}
		(*lastPos) += progPos;
		if (targetBuffer[(*lastPos)] != '.')
		{
			return false;
		}
		(*lastPos)++;
	}

	// last is not '.'
	if (!UECSAtoI_UChar(&targetBuffer[(*lastPos)], &ip[3], &progPos))
	{
		return false;
	}
	(*lastPos) += progPos;

