andotoecno/UARDECS_esp32/lib/UARDECS_esp32/UARDECS_esp32.cpp
	return true;
}

//------------------------------------------------------------------------------
bool UECSAtoI_UChar(char *targetBuffer, unsigned char *ucharValue, int *lastPos)
{
	unsigned int newValue = 0;
	bool validFlag = false;

	int i;

	for (i = 0; i < MAX_DIGIT; i++)
	{
		if (targetBuffer[i] >= '0' && targetBuffer[i] <= '9')
		{
			validFlag = true;
			newValue = newValue * 10;
			newValue += (targetBuffer[i] - '0');
			if (newValue > 255)
			{
				return false;
			} // over flow!
			continue;
		}

		break;
	}

	*lastPos = i;
	*ucharValue = newValue;

	return validFlag;
}
//------------------------------------------------------------------------------
bool UECSGetFixedFloatValue(char *targetBuffer, long *longVal, unsigned char *decimal, int *lastPos)
{
	*longVal = 0;
	*decimal = 0;
	int i;
	int validFlag = 0;
	bool floatFlag = false;
	char signFlag = 1;
	unsigned long newValue = 0;
	unsigned long prvValue = 0;

	for (i = 0; i < MAX_DIGIT; i++)
	{
		if (targetBuffer[i] == '.')
		{
			if (floatFlag)
			{
				return false;
			} // Multiple symbols error
			floatFlag = true;
			continue;
		}
		else if (targetBuffer[i] == '-')
		{
			if (validFlag)
			{
				return false;
			} // Symbol is after number
			if (signFlag < 0)
			{
				return false;
			} // Multiple symbols error
			signFlag = -1;
			continue;
		}
		else if (targetBuffer[i] >= '0' && targetBuffer[i] <= '9')
		{

			validFlag = true;
			if (floatFlag)
			{
				(*decimal)++;
			}
			newValue = newValue * 10;
			newValue += (targetBuffer[i] - '0');
			if (prvValue > newValue || newValue > 2147483646)
			{
				return false;
			} // over flow!
			prvValue = newValue;
			continue;
		}

		break;
	}

	*longVal = ((long)newValue) * signFlag;
	*lastPos = i;

	return validFlag;
}

//------------------------------------
void MemoryWatching()
{
	if (UECStempStr20[MAX_TYPE_CHAR - 1] != 0 || UECSbuffer[BUF_SIZE - 1] != 0)
	{
		U_orgAttribute.status |= STATUS_MEMORY_LEAK;
	}
}
//------------------------------------
// In Safemode this function is not working properly because Web value will be reset.
bool ChangeWebValue(signed long *data, signed long value)
{
	for (int i = 0; i < U_HtmlLine; i++)
	{
		if (U_html[i].data == data)
		{
			*(U_html[i].data) = value;
			UECS_EEPROM_writeLong(EEPROM_OFFSET_WEBDATA + i * 4, *(U_html[i].data));
			return true;
		}
	}
	return false;
}
